app/views/format_item_links/index.html.erb

<h1> <%= pluralize(@format_item_links.size,'FormatItemLink') %> </h1>
---
SELECT "format_item_links".* FROM "format_item_links"  WHERE "format_item_links"."format_item_id" = ?  [["format_item_id", 3]]
SELECT COUNT(*) FROM "format_item_links"  WHERE "format_item_links"."format_item_id" = ?  [["format_item_id", 1]]