app/views/format_versions/index.html.erb

SELECT "format_versions".* FROM "format_versions"  WHERE "format_versions"."format_id" = ?  [["format_id", 1]]
SELECT COUNT(*) FROM "format_versions"  WHERE "format_versions"."format_id" = ?  [["format_id", 1]]
---
<h1> <%= pluralize(@format_versions.size, 'FormatVersion') %> </h1>