app/views/dimensions/index.html.erb

<h1><%=pluralize(@dimensions.size,'Dimension') %></h1>
---
SELECT "dimensions".* FROM "dimensions"
SELECT COUNT(*) FROM "dimensions"