app/views/formats/index.html.erb

<h1> <%= pluralize(@formats.size,'Format') %></h1>
---
SELECT "formats".* FROM "formats"
SELECT COUNT(*) FROM "formats"