app/views/dim_items/index.html.erb

<h1> <%= pluralize(@dim_items.size, 'DimItem') %> </h1>
---
SELECT "dim_items".* FROM "dim_items"
SELECT COUNT(*) FROM "dim_items"