app/controllers/dim_items_controller.rb

SELECT  "dimensions".* FROM "dimensions"  WHERE "dimensions"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    $USERPATH_VAR = 'dim'
    @dimensions = Dimension.all
    @dimension = Dimension.find(params[:dimension_id])