app/controllers/dim_formats_controller.rb

SELECT  "dimensions".* FROM "dimensions"  WHERE "dimensions"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @dimension = Dimension.find(params[:dimension_id])