app/controllers/dimensions_controller.rb

SELECT "dimensions".* FROM "dimensions"
---
  def index
    @dimensions = Dimension.all

SELECT  "dimensions".* FROM "dimensions"  WHERE "dimensions"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @dimension = Dimension.find(params[:id])