app/controllers/format_versions_controller.rb

SELECT  "formats".* FROM "formats"  WHERE "formats"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    # pak het format uit Format met id = format_versions.format_id)
    @format = Format.find(params[:format_id])