app/controllers/formats_controller.rb

SELECT "formats".* FROM "formats"
---
  def index
    @formats = Format.all

SELECT  "formats".* FROM "formats"  WHERE "formats"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @format = Format.find(params[:id])