app/controllers/format_items_controller.rb

SELECT  "formats".* FROM "formats"  WHERE "formats"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "format_versions".* FROM "format_versions"  WHERE "format_versions"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    $USERPATH_VAR = 'form'
    @format = Format.find(params[:format_id])
    @format_version = FormatVersion.find(params[:format_version_id])