app/controllers/format_item_links_controller.rb

  def index
    if $userpath_var == 'form'
      @format = Format.find(params[:format_id])
      @format_versions = @format.format_versions
      @format_version = FormatVersion.find(params[:format_version_id])
      @format_items = @format_version.format_items
      @format_item = FormatItem.find(params[:format_item_id])
      @format_item_links = @format_item.format_item_links
    else
      @dimension = Dimension.find(params[:dimension_id])
---
SELECT  "formats".* FROM "formats"  WHERE "formats"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "format_versions".* FROM "format_versions"  WHERE "format_versions"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "dim_items".* FROM "dim_items"  WHERE "dim_items"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "format_items".* FROM "format_items"  WHERE "format_items"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "dimensions".* FROM "dimensions"  WHERE "dimensions"."id" = ? LIMIT 1  [["id", 2]]